def hotel_names
  hotel_names = [
    "白雪",
    "薔薇の宿",
    "オリエンタル",
    "エンジェル",
    "天使の宿",
    "天使の羽根",
    "ラブリー",
    "ハート",
    "スウィート",
    "ピンク",
    "アモーレ",
    "ディアマンテ",
    "ルージュ",
    "パッション",
    "ラブ",
    "ハーモニー",
    "クレセントムーン",
    "フローラ",
    "ハッピー",
    "キス",
    "キャンドル",
    "クリスタル",
    "プリンセス",
    "プリティ",
    "ミスティック",
    "モノクロ",
    "ドリーム",
    "フェアリー",
    "フレンドリー",
    "セレナーデ",
    "ザ・ブラック",
    "ゴールデン",
    "ミラクル",
    "スターライト",
    "ビューティフル",
    "ブルー",
    "ヒーロー",
    "ホワイト",
    "パンドラ",
    "メルヘン",
    "メルティング",
    "ラピス",
    "レッド",
    "ローズ",
    "キャッスル",
    "ハイライト",
    "エコー",
    "エンターテイメント",
    "グロリアス",
    "サンセット",
    "シャンティ",
    "ジュピター",
    "ゼフィール",
    "タイムレス",
    "テラス",
    "デュエット",
    "トロピカル",
    "ドラゴン",
    "ネオン",
    "ノーブル",
    "ノワール",
    "バブル",
    "フォーエバー",
    "プライド",
    "プレミアム",
    "フィクション",
    "フィール",
    "フロスト",
    "ヘブンリー",
    "ホリデー",
    "ボンジュール",
    "マーブル",
    "マジック",
    "マスカレード",
    "ミステリー",
    "ミルキー",
    "ムーンライト",
    "レトロ",
    "ロマンチック",
    "ワンダー",
    "ダイヤモンド",
    "ニューヨーク",
    "ビバリーヒルズ",
    "シンデレラ",
    "アラビアン",
    "イエロー",
    "ラグーン",
    "モノポリー",
    "モンテカルロ",
    "ミュージック",
    "フローティング",
    "ジャス"  
  ]
  return hotel_names
end

def hotel_content
  hotel_content = [
    "「大人の隠れ家」でゆっくりとした時間を過ごしてみませんか？ここでは落ち着いた雰囲気と上質な設備が自慢です。快適な空間で特別な時間をお過ごしください。",
    "当ホテルは、都会の喧騒から離れた静かな場所にあります。プライベート感たっぷりの客室で、心身ともにリラックスしていただけます。",
    "カップルにぴったりの空間を提供します。エレガントでモダンな内装と、充実したアメニティで、愛を深めるための素晴らしい時間をお約束します。",
    "夜景を楽しめる高層階の客室、選べるジャグジー、バスタブ、シャワーなど多彩な客室設備をご用意しています。非日常的な空間で、至福の時間をお過ごしください。",
    "ここでは、プライバシーに配慮した客室と、心地よい空間をご提供しています。特別な日には、特別な空間で過ごしてみませんか？",
    "当ホテルは、お二人だけの特別な空間を提供いたします。快適な空間でリラックスしながら、大切な時間をお過ごしください。プライバシーを重視した空間で、心安らぐ時間をお過ごしいただけます。",
    "ここは、大人の隠れ家としての役割を果たすホテルです。美しいインテリアと設備が充実しており、思い出に残るひとときをお過ごしいただけます。落ち着いた空間で、心地よい時間をお過ごしください。",
    "当ホテルは、お二人だけの非日常空間を提供いたします。居心地の良い空間で、快適に過ごしていただけます。高級感のある設備と上質なサービスで、思い出に残る時間をお過ごしください。",
    "ここは、特別なひとときを過ごすためのラブホテルです。上質なインテリアと設備が自慢で、お二人だけのプライベートな空間を提供いたします。リラックスして過ごせる快適な空間で、大切な時間をお過ごしください。",
    "当ホテルは、お二人の大切な時間を演出するために作られたラブホテルです。洗練された空間で、上質な時間をお過ごしください。快適な空間と充実した設備で、心安らぐ時間をお過ごしいただけます。",
    "ここは、お二人だけの贅沢な空間を提供するラブホテルです。上質な設備とサービスで、思い出に残る時間をお過ごしください。プライベートな空間で過ごせるリラックスしたひとときをお楽しみいただけます。",
    ]
    return hotel_content
end

def hotel_fee
  hotel_fee = [
    "
    宿泊
    
    月・火/ウィークデイステイ]
    
    9680円～12000円 （ 21:00～翌11:00 ）
    
    [月・火/アーリーアウトステイ]
    
    8680円～11000円 （ 21:00～翌08:00 ）
    
    [月・火/レイトインステイ]
    
    9450円～11800円 （ 00:00～13:00 ）
    
    [水・木/ウィークデイステイ]
    
    9980円～12800円 （ 21:00～翌11:00 ）
    
    [水・木/アーリーアウトステイ]
    
    8980円～11800円 （ 21:00～翌08:00 ）
    
    [水・木/レイトインステイ]
    
    9680円～12500円 （ 00:00～13:00 ）
    
    [金/ウィークエンドステイ]
    
    12500円～14800円 （ 22:00～翌10:00 ）
    
    [土/ウィークエンドステイ]
    
    13250円～15500円 （ 22:00～翌10:00 ）
    
    [日・祝/ホリデーステイ]
    
    9680円～11750円 （ 20:00～翌12:00 ）
    
    *チェックアウト時刻を過ぎますと延長料金が加算されます。
    *年末年始・ゴールデンウィーク等の期間に関しましては、各曜日料金およびプラン適用についての変更がございます。詳しくはホテルまでお問い合わせください。
    休憩
    [月・火]
    
    5600円～6450円 （ 06:00～24:00 滞在時間4時間 ）
    
    [水・木・金]
    
    5800円～6650円 （ 06:00～24:00 滞在時間4時間 ）
    
    [土・日・祝]
    
    6350円～7150円 （ 06:00～24:00 滞在時間4時間 ）
    
    *4時間を過ぎますと延長料金が加算されます。
    
    【ショートタイム】
    [月・火] 3830 ～4300 円 ( 6:00～24:00 / 90分 )
    [水・木] 3950 ～4600 円 ( 6:00～24:00 / 90分 )
    [金・土・日・祝] 4080 ～4800 円 ( 6:00～24:00 / 90分 )
    *90分を過ぎますと延長料金が加算されます。
    
    *終了時刻の24:00を超えてのご利用はできません。また在室中に24:00を経過しますと、チェックイン時刻にさかのぼり宿泊プランでのご滞在となります。
    *年末年始・ゴールデンウィーク等の期間に関しましては、各曜日料金およびプラン適用についての変更がございます。詳しくはホテルまでお問い合わせください。
    サービスタイム
    【デイユース(フリータイム)】
    [月・火1部] 5100 ～5900 円 ( 6:00～16:00 / 10.0h )
    [月・火2部] 5100 ～5900 円 ( 10:00～18:00 / 8.0h )
    [月・火3部] 5300 ～6150 円 ( 13:00～20:00 / 7.0h )
    [水・木・金1部] 5300 ～6100 円 ( 6:00～16:00 / 10.0h )
    [水・木・金2部] 5300 ～6100 円 ( 10:00～18:00 / 8.0h )
    [水・木3部] 5600 ～6450 円 ( 13:00～20:00 / 7.0h )
    [金3部] 5800 ～6650 円 ( 13:00～20:00 / 7.0h )
    [土・日・祝1部] 5800 ～6620 円 ( 6:00～16:00 / 10.0h )
    [土・日・祝2部] 6100 ～6850 円 ( 10:00～18:00 / 8.0h )
    *各プランで終了時刻を経過しますと、自動的に延長料金が加算されます。
    *年末年始・ゴールデンウィーク等の期間に関しましては、各曜日料金およびプラン適用についての変更がございます。詳しくはホテルまでお問い合わせください。",
    
    "
    宿泊
    [日～木・祝]
    
    9800円～29800円 （ 18:00～翌12:00 ）
    
    [金]
    
    12800円～34800円 （ 18:00～翌11:00 ）
    
    [土・祝前・連休中日]
    
    13800円～36800円 （ 21:00～翌10:00 ）
    
    ※24:00～翌5:00のINは[月～木・日・祝]12h保証、[金・土・祝前]10h保証
    ※平日3時IN→15時まで利用可
    休憩
    [月～金・祝前日]
    
    5980円～16800円 （ 18:00～翌01:00 滞在時間3時間 ）
    
    [土・特定日]
    
    6480円～17300円 （ 18:00～翌02:00 滞在時間3時間 ）
    
    [日・祝日]
    
    6480円～17300円 （ 18:00～翌01:00 滞在時間3時間 ）
    
    サービスタイム
    [月～金・祝前　1部]
    
    5980円～16800円 （ 05:00～18:00 滞在時間13時間 ）
    
    [月～金・祝前　2部]
    
    5980円～16800円 （ 12:00～21:00 滞在時間6時間 ）
    
    [土・日・特定日　1部]
    
    6480円～17300円 （ 05:00～16:00 滞在時間11時間 ）
    
    [土・日・特定日　2部]
    
    6480円～17300円 （ 12:00～21:00 滞在時間4時間 ）
    
    延長料金
    [全日]
    
    700円～1500円 /15分",
    
    "
    宿泊
    [日～木]
    
    7480円～12980円 （ 19:00～翌12:00 ）
    
    [金・土・祝前]
    
    15180円～18480円 （ 21:00～翌12:00 ）
    
    休憩
    [全日]4,620円均一(2h)
    [全日]5,500円均一(3h)
    [全日]6,380円均一(4h)
    ※402号室のみそれぞれ、6820円(3h)・7,700円(4h)・8,580円(5h)になります。
    
    ■お1人様利用サービス
    [全日] 4,180円均一 ( 7：00 ~ 24:00 /2h )
    ※102・203・303・403のお部屋のみ
    サービスタイム
    [全日1部]
    
    4620円～8250円 （ 07:00～18:00 滞在時間11時間 ）
    
    [全日2部]
    
    4620円～8250円 （ 12:00～19:00 滞在時間7時間 ）
    
    延長料金
    [全日]
    
    1100円 /30分",
    
    "
    宿泊
    [月～木1部]
    
    6800円 均一 （ 20:00～翌12:00 最大16時間 ）
    
    [月～木2部]
    
    6800円 均一 （ 24:00～翌14:00 最大14時間 ）
    
    [金曜1部]
    
    8800円～9800円 （ 21:00～翌11:00 最大14時間 ）
    
    [金曜2部]
    
    9200円～10200円 （ 24:00～翌12:00 最大12時間 ）
    
    [土・祝前1部]
    
    10800円～11800円 （ 22:00～翌10:00 最大12時間 ）
    
    [土・祝前2部]
    
    10800円～11800円 （ 01:00～13:00 最大12時間 ）
    
    [日・祝1部]
    
    6800円 均一 （ 20:00～翌12:00 最大16時間 ）
    
    [日・祝2部]
    
    6800円 均一 （ 24:00～翌14:00 最大14時間 ）
    
    カップルズクーポン利用でお得な割引サービス実施中！
    ・日曜・祝日・平日 宿泊 1.000円OFF
    （当ホテルにおける特別日等は除く）
    
    ・金曜日・土曜日 宿泊 1.500円OFF
    （当ホテルにおける特別日等は除く）
    休憩
    [全日（ショートタイム）]
    
    3500円 均一 （ 24時間制の間で最大 滞在時間2時間 ）
    
    [月～金（3時間）]
    
    4300円～4800円 （ 24時間制の間で最大 滞在時間3時間 ）
    
    [土・日・祝（3時間）]
    
    4800円～5300円 （ 24時間制の間で最大 滞在時間3時間 ）
    
    カップルズクーポン利用でお得な割引サービス実施中！
    【全日】　
    ・休憩　500円OFF
    （ショートタイムも可）
    サービスタイム
    [月～金1部]
    
    4300円～4800円 （ 05:00～17:00 の間で最大 滞在時間12時間 ）
    
    [土・日・祝1部]
    
    4800円～5300円 （ 05:00～15:00 の間で最大 滞在時間10時間 ）
    
    延長料金
    [全日]
    
    1000円 /20分",

    "
    宿泊
    [日～木1部] ￥7900～ ( 20:00～翌12:00 )
    [日～木2部] ￥7900～ ( 23:00～翌13:00 )
    [日～木3部] ￥7900～ (深夜1時以降～朝6時までのご入室は基本宿泊料金で12時間ご利用頂けます。)
    [金・土・祝前1部] 9600円 ～ ( 21:00～11:00 )
    [金・土・祝前2部] 9600円 ～ ( 0:00～12:00 )
    休憩
    【休憩】
    [月～金] ￥4900～ ( 6:00～24:00 / 3h )
    [土･日・祝]￥ 5900～ ( 6:00～24:00 / 3h )
    
    【深夜休憩】
    [日～木] 6400円 ～ ( 0:00～6:00/2.0h )
    [金・土・祝前] 6900円 ～ ( 0:00～6:00/2.0h )
    
    【ショートタイム】
    [月～金] 3900円 ～ ( 6:00～24:00/1.5h )
    サービスタイム
    【フリータイム】
    [月～金1部] 4900円 ～ ( 6:00～18:00 / 12.0h )
    [月～金2部] 4900円 ～ ( 11:00～20:00 / 9.0h )
    [月～金3部] 4900円 ～ ( 15:00～22:00 / 7.0h )
    [土・日・祝1部] 5900円 ～ ( 6:00～15:00 / 9.0h )
    [土・日・祝2部] 5900円 ～ ( 11:00～17:00 / 6.0h )
    [土・日・祝3部] 5900円 ～ ( 13:00～19:00 / 6.0h )",

    "
    宿泊
    [日～木・祝日]
    
    9800円～23800円 （ 18:00～翌11:00 （23時以降のご宿泊は、チェックインより最低12時間保証） ）
    
    [金・祝前]
    
    12800円～26800円 （ 21:00～翌10:00 （24時以降のご宿泊は、チェックインより最低10時間保証） ）
    
    [土・特定日]
    
    14800円～28800円 （ 22:00～翌10:00 （24時以降のご宿泊は、チェックインより最低10時間保証） ）
    
    休憩
    [月～金]
    
    4800円～12800円 （ 18:00～翌27:00 滞在時間3時間 ）
    
    [土・日・特定日]
    
    5300円～13300円 （ 18:00～翌27:00 滞在時間3時間 ）
    
    深夜3時を過ぎると自動的に宿泊料金に切替となります。
    サービスタイム
    [月～金・祝前日　1部]
    
    4800円～12800円 （ 06:00～17:00 ）（※最大 滞在時間11時間 ）
    
    [月～金・祝前日　2部]
    
    4800円～12800円 （ 12:00～21:00 ）（※最大 滞在時間5時間 ）
    
    [土・日・特定日　1部]
    
    5300円～13300円 （ 06:00～16:00 ）（※最大 滞在時間10時間 ）
    
    [土・日・特定日　2部]
    
    5300円～13300円 （ 12:00～21:00 ）（※最大 滞在時間4時間 ）
    
    延長料金
    [全日]
    
    800円～2200円 /30分",

    "宿泊
    [平日1部]
    
    7690円～10990円 （ 15:00～翌12:00 最大21時間 ）
    
    [平日2部]
    
    7690円～10990円 （ 22:00～翌14:00 最大16時間 ）
    
    [金曜日]
    
    8790円～13190円 （ 15:00～翌12:00 最大21時間 ）
    
    [土・祝前日]
    
    10990円～15390円 （ 15:00～翌10:00 最大19時間 ）
    
    休憩
    [平日1部]
    
    3840円～6590円 （ 06:00～24:00 滞在時間2時間 ）
    
    [平日2部]
    
    5490円～8790円 （ 06:00～24:00 滞在時間5時間 ）
    
    [休日1部]
    
    4940円～7690円 （ 06:00～24:00 滞在時間2時間 ）
    
    [休日2部]
    
    6590円～9890円 （ 06:00～24:00 滞在時間4時間 ）
    
    サービスタイム
    [平日1部]
    
    5490円～8790円 （ 06:00～20:00 滞在時間14時間 ）
    
    [平日2部]
    
    5490円～8790円 （ 12:00～22:00 滞在時間10時間 ）
    
    [平日3部]
    
    5490円～8790円 （ 16:00～24:00 滞在時間8時間 ）
    
    [休日1部]
    
    6590円～9890円 （ 06:00～16:00 滞在時間10時間 ）
    
    [休日2部]
    
    6590円～9890円 （ 11:00～18:00 滞在時間7時間 ）
    
    延長料金
    [全日]
    
    1100円 /30分",
    ]
    return hotel_fee
end

def five_or_four_reviews_title
  reviews = [
"最高でした", "行ってよかった", "このあたりのホテルでは一番です", "改装してキレイになった", "おすすめです","スタッフの対応が良い", "安くておすすめ", "最高の滞在体験！",  "パーフェクトなサービスと設備",  "快適で贅沢な滞在ができました！",  "素晴らしいホテル体験を提供してくれました",  "期待以上です。",  "完璧なホテルでした",  "絶対におすすめできるホテルです！",  "快適でした",  "アメニティが豊富でした。",  "サービスが最高でした", "いいよ"
  ]
  return reviews
end

def three_reviews_title
  reviews = [
    "普通の部屋だけど、値段はちょっと高いかな。",
    "サービスは良いけど、清潔感に少し不満があった。",
    "騒音が気になったけど、まあまあだったかな。",
    "期待したほどでもなかった。",
    "あまりお勧めできません。",
    "コスパは普通です。",
    "設備がちょっと古い。",
    "もう少し広いとよかったかな。",
    "まあまあのホテルだった。",
    "ロケーションは良かった。",
  ]
  return reviews
end

def one_or_two_reviews_title
  reviews = 
    ["清潔さに不安があった",  "期待はずれの部屋だった",  "心地よく寝られなかった",  "設備が古い",  "部屋が狭かった",  "サービスに不満があった",  "何かが欠けている感じがした",  "他のホテルのほうが良い",  "コスパが悪かった",  "二度と泊まりたくない"
  ]
  return reviews
end

def five_or_four_reviews_content
  reviews = ["清潔感があり、内装もおしゃれで素敵でした。スタッフの対応も丁寧で、とても快適に過ごせました。また利用します。",
    "今まで利用したラブホテルの中で一番のお気に入りです。設備も充実していて、清潔感もあってとても快適でした。",
    "予約からチェックアウトまでスムーズで、スタッフの対応もよかったです。お部屋も綺麗で、アメニティも豊富でした。",
    "部屋がとても広くて快適でした。内装もおしゃれで、清潔感もありました。スタッフの対応もよく、また利用したいと思います。",
    "ロマンチックな雰囲気で、彼女との時間を満喫できました。お部屋も綺麗で、スタッフの方々も親切でした。また利用したいと思います！",
    "料金もリーズナブルで、設備も充実していて満足でした。清潔感もあって、スタッフの対応もよかったです。また利用したいと思います。",
    "お部屋がとてもおしゃれで、快適に過ごせました。アメニティも豊富で、スタッフの方々も親切でした。また利用したいと思います。",
    "エントランスやお部屋の内装がとてもおしゃれで、居心地がよかったです。清潔感もあって、スタッフの方々も丁寧でした。また利用したいと思います。",
    "設備が充実していて、お部屋も清潔で快適でした。スタッフの方々も親切で、気持ちよく過ごせました。また利用したいと思います。",
    "お部屋が広くて、内装もおしゃれで、快適に過ごせました。清潔感もあり、スタッフの対応もよかったです。また利用したいと思います。",
    "素晴らしい宿泊体験でした。お部屋の内装も素晴らしく、清潔感も抜群でした。スタッフの方々の対応も非常に良かったです!!!",
      "とても居心地の良い宿泊体験でした。お部屋の内装も素晴らしく、設備も充実していました。スタッフの方々の対応も素晴らしかったです。",
      "最高の宿泊体験でした。お部屋はとても綺麗で、広々としていて快適に過ごせました。スタッフの方々の対応も丁寧で、大変満足しました。",
      "素晴らしいホテルでした。お部屋は広くて清潔感もあり、設備も充実していました。スタッフの方々の対応もとても素晴らしく、また利用したいと思います。",
      "最高のサービスを提供していただき、大変満足しました。お部屋も素晴らしかったです！","とても素敵なホテルでした。お部屋も広く、清潔感もあり、とても快適に過ごすことができました。スタッフの方々もとても親切で、また利用したいと思います。",
        "ロケーションが最高でした。お部屋からの景色も素晴らしく、朝食も美味しくいただきました。スタッフの方々も非常に丁寧で、また利用したいと思います。",
        "設備も新しく、清潔感もあり、とても快適に過ごすことができました。お部屋からの景色も素晴らしく、スタッフの方々もとても親切でした。"]
    return reviews
end

def three_reviews_content
  reviews = ["お部屋は綺麗で、設備も充実していましたが、少し窮屈に感じました。スタッフの方々の対応も普通でした。","予約がスムーズにできたのは良かったですが、お部屋が少し暗く感じました。スタッフの方々は丁寧ではあったが、特に印象に残ることはありませんでした。","内装やアメニティは充実していましたが、お部屋が少し狭く感じました。スタッフの方々の対応は普通で、特に良かったところはありませんでした。","設備が充実していたが、お部屋の壁が薄く、少し騒音が気になりました。スタッフの方々の対応は普通でした。","清潔感はあったが、お部屋が少し古めかしく感じました。スタッフの方々は丁寧ではあったが、特に印象に残ることはありませんでした。","お部屋の内装はおしゃれで綺麗でしたが、少し狭く感じました。スタッフの方々は普通で、特に良かったところはありませんでした。","予約からチェックアウトまでスムーズでしたが、お部屋が少し暗く感じました。スタッフの方々は普通でした。","お部屋は清潔でしたが、設備が少し古めかしく感じました。スタッフの方々は丁寧ではあったが、特に印象に残ることはありませんでした。","設備やアメニティは充実していましたが、お部屋が少し狭く感じました。スタッフの方々の対応は普通で、特に良かったところはありませんでした。","お部屋は広くて清潔でしたが、内装が少し古めかしく感じました。スタッフの方々の対応は普通でした。"]
  return reviews
end

def two_or_one_reviews_content
  review = ["お部屋の清潔感に少し不満がありました。設備も古めかしく、使いにくかったです。スタッフの方々の対応も普通でした。","お部屋が暗く、窓からの風通しが悪く、少し息苦しく感じました。スタッフの方々の対応も特に印象に残ることはありませんでした。","予約がスムーズにできたのは良かったですが、お部屋が少し狭く感じました。スタッフの方々は普通で、特に良かったところはありませんでした。","設備が古く、使いにくかったです。お部屋も少し暗く感じました。スタッフの方々の対応は普通でした。","お部屋が少し古めかしく、清潔感にも不満がありました。スタッフの方々の対応も普通でした。","お部屋が少し窮屈に感じました。設備も古く、使いにくかったです。スタッフの方々の対応も普通でした。","お部屋の内装が古く、清潔感にも不満がありました。スタッフの方々の対応も普通でした。","お部屋が暗く、窓からの風通しが悪かったです。設備も古く、使いにくかったです。スタッフの方々の対応も普通でした。","お部屋が少し狭く、窮屈に感じました。設備も古く、使いにくかったです。スタッフの方々の対応も普通でした。","お部屋の清潔感に不満がありました。設備も古く、使いにくかったです。スタッフの方々の対応も普通でした。"]
  return review
end

def user_name
  user_name = [
    Faker::Name.name, Faker::Name.first_name, Faker::Name.last_name, Faker::JapaneseMedia::StudioGhibli.character
  ]
  return user_name
end